; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-40)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 ball40 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(ball ball39)
(ball ball40)
(free left)
(at ball1 rooma)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room6)
(at ball33 room6)
(at ball34 room6)
(at ball35 room6)
(at ball36 room6)
(at ball37 room6)
(at ball38 room6)
(at ball39 room6)
(at ball40 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room5)
(at ball34 room5)
(at ball35 room5)
(at ball36 room5)
(at ball37 room6)
(at ball38 room6)
(at ball39 room6)
(at ball40 room6)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 40
2. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 7 of 40
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 7 of 40
4. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 8 of 40
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 40
6. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 8 of 40
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 8 of 40
8. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 9 of 40
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 40
10. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 9 of 40
11. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 9 of 40
12. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 10 of 40
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 10 of 40
14. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 10 of 40
15. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 40
16. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 11 of 40
17. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 40
18. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 11 of 40
19. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 40
20. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 12 of 40
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 40
22. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 12 of 40
23. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 12 of 40
24. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 13 of 40
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 40
26. (pick ball2 roomb left)
   deleted: (at ball2 roomb) (free left)
   added: (carry ball2 left)
   goals met: 13 of 40
27. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 40
28. (drop ball2 rooma left)
   deleted: (carry ball2 left)
   added: (at ball2 rooma) (free left)
   goals met: 14 of 40
29. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 40
30. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 14 of 40
31. (pick ball36 room6 left)
   deleted: (at ball36 room6) (free left)
   added: (carry ball36 left)
   goals met: 14 of 40
32. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 14 of 40
33. (drop ball36 room5 left)
   deleted: (carry ball36 left)
   added: (at ball36 room5) (free left)
   goals met: 15 of 40
34. (pick ball31 room5 left)
   deleted: (at ball31 room5) (free left)
   added: (carry ball31 left)
   goals met: 15 of 40
35. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 15 of 40
36. (drop ball31 room4 left)
   deleted: (carry ball31 left)
   added: (at ball31 room4) (free left)
   goals met: 16 of 40
37. (pick ball20 room4 left)
   deleted: (at ball20 room4) (free left)
   added: (carry ball20 left)
   goals met: 16 of 40
38. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 16 of 40
39. (drop ball20 room3 left)
   deleted: (carry ball20 left)
   added: (at ball20 room3) (free left)
   goals met: 17 of 40
40. (pick ball9 room3 left)
   deleted: (at ball9 room3) (free left)
   added: (carry ball9 left)
   goals met: 17 of 40
41. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 17 of 40
42. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 18 of 40
43. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 18 of 40
44. (pick ball35 room6 left)
   deleted: (at ball35 room6) (free left)
   added: (carry ball35 left)
   goals met: 18 of 40
45. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 18 of 40
46. (drop ball35 room5 left)
   deleted: (carry ball35 left)
   added: (at ball35 room5) (free left)
   goals met: 19 of 40
47. (pick ball30 room5 left)
   deleted: (at ball30 room5) (free left)
   added: (carry ball30 left)
   goals met: 19 of 40
48. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 19 of 40
49. (drop ball30 room4 left)
   deleted: (carry ball30 left)
   added: (at ball30 room4) (free left)
   goals met: 20 of 40
50. (pick ball19 room4 left)
   deleted: (at ball19 room4) (free left)
   added: (carry ball19 left)
   goals met: 20 of 40
51. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 20 of 40
52. (drop ball19 room3 left)
   deleted: (carry ball19 left)
   added: (at ball19 room3) (free left)
   goals met: 21 of 40
53. (pick ball12 room3 left)
   deleted: (at ball12 room3) (free left)
   added: (carry ball12 left)
   goals met: 21 of 40
54. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 21 of 40
55. (drop ball12 roomb left)
   deleted: (carry ball12 left)
   added: (at ball12 roomb) (free left)
   goals met: 22 of 40
56. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 22 of 40
57. (pick ball34 room6 left)
   deleted: (at ball34 room6) (free left)
   added: (carry ball34 left)
   goals met: 22 of 40
58. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 22 of 40
59. (drop ball34 room5 left)
   deleted: (carry ball34 left)
   added: (at ball34 room5) (free left)
   goals met: 23 of 40
60. (pick ball29 room5 left)
   deleted: (at ball29 room5) (free left)
   added: (carry ball29 left)
   goals met: 23 of 40
61. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 23 of 40
62. (drop ball29 room4 left)
   deleted: (carry ball29 left)
   added: (at ball29 room4) (free left)
   goals met: 24 of 40
63. (pick ball18 room4 left)
   deleted: (at ball18 room4) (free left)
   added: (carry ball18 left)
   goals met: 24 of 40
64. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 24 of 40
65. (drop ball18 room3 left)
   deleted: (carry ball18 left)
   added: (at ball18 room3) (free left)
   goals met: 25 of 40
66. (pick ball11 room3 left)
   deleted: (at ball11 room3) (free left)
   added: (carry ball11 left)
   goals met: 25 of 40
67. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 25 of 40
68. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 26 of 40
69. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 26 of 40
70. (pick ball33 room6 left)
   deleted: (at ball33 room6) (free left)
   added: (carry ball33 left)
   goals met: 26 of 40
71. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 26 of 40
72. (drop ball33 room5 left)
   deleted: (carry ball33 left)
   added: (at ball33 room5) (free left)
   goals met: 27 of 40
73. (pick ball28 room5 left)
   deleted: (at ball28 room5) (free left)
   added: (carry ball28 left)
   goals met: 27 of 40
74. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 27 of 40
75. (drop ball28 room4 left)
   deleted: (carry ball28 left)
   added: (at ball28 room4) (free left)
   goals met: 28 of 40
76. (pick ball17 room4 left)
   deleted: (at ball17 room4) (free left)
   added: (carry ball17 left)
   goals met: 28 of 40
77. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 28 of 40
78. (drop ball17 room3 left)
   deleted: (carry ball17 left)
   added: (at ball17 room3) (free left)
   goals met: 29 of 40
79. (pick ball10 room3 left)
   deleted: (at ball10 room3) (free left)
   added: (carry ball10 left)
   goals met: 29 of 40
80. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 29 of 40
81. (drop ball10 roomb left)
   deleted: (carry ball10 left)
   added: (at ball10 roomb) (free left)
   goals met: 30 of 40
82. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 30 of 40
83. (pick ball32 room6 left)
   deleted: (at ball32 room6) (free left)
   added: (carry ball32 left)
   goals met: 30 of 40
84. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 30 of 40
85. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 30 of 40
86. (drop ball32 room4 left)
   deleted: (carry ball32 left)
   added: (at ball32 room4) (free left)
   goals met: 31 of 40
87. (pick ball16 room4 left)
   deleted: (at ball16 room4) (free left)
   added: (carry ball16 left)
   goals met: 31 of 40
88. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 31 of 40
89. (drop ball16 room3 left)
   deleted: (carry ball16 left)
   added: (at ball16 room3) (free left)
   goals met: 32 of 40
90. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 32 of 40
91. (pick ball27 room5 left)
   deleted: (at ball27 room5) (free left)
   added: (carry ball27 left)
   goals met: 32 of 40
92. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 32 of 40
93. (drop ball27 room4 left)
   deleted: (carry ball27 left)
   added: (at ball27 room4) (free left)
   goals met: 33 of 40
94. (pick ball15 room4 left)
   deleted: (at ball15 room4) (free left)
   added: (carry ball15 left)
   goals met: 33 of 40
95. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 33 of 40
96. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 34 of 40
97. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 34 of 40
98. (pick ball26 room5 left)
   deleted: (at ball26 room5) (free left)
   added: (carry ball26 left)
   goals met: 34 of 40
99. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 34 of 40
100. (drop ball26 room4 left)
   deleted: (carry ball26 left)
   added: (at ball26 room4) (free left)
   goals met: 35 of 40
101. (pick ball14 room4 left)
   deleted: (at ball14 room4) (free left)
   added: (carry ball14 left)
   goals met: 35 of 40
102. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 35 of 40
103. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 36 of 40
104. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 36 of 40
105. (pick ball25 room5 left)
   deleted: (at ball25 room5) (free left)
   added: (carry ball25 left)
   goals met: 36 of 40
106. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 36 of 40
107. (drop ball25 room4 left)
   deleted: (carry ball25 left)
   added: (at ball25 room4) (free left)
   goals met: 37 of 40
108. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 37 of 40
109. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 37 of 40
110. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 38 of 40
111. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 38 of 40
112. (pick ball24 room5 left)
   deleted: (at ball24 room5) (free left)
   added: (carry ball24 left)
   goals met: 38 of 40
113. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 38 of 40
114. (drop ball24 room4 left)
   deleted: (carry ball24 left)
   added: (at ball24 room4) (free left)
   goals met: 39 of 40
115. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 39 of 40
116. (pick ball23 room5 left)
   deleted: (at ball23 room5) (free left)
   added: (carry ball23 left)
   goals met: 39 of 40
117. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 39 of 40
118. (drop ball23 room4 left)
   deleted: (carry ball23 left)
   added: (at ball23 room4) (free left)
   goals met: 40 of 40
